{"input": "How does the interaction between Dark Depths and Vampire Hexmage work? Can you explain the rules involved?", "output": "The interaction between Dark Depths and Vampire Hexmage is a popular combo in formats like Modern and Legacy. Here's how it works and the rules behind it:\n\nDark Depths is a legendary snow land with the following text:\n\"Dark Depths enters the battlefield with 10 ice counters on it.\nWhen Dark Depths has no ice counters on it, sacrifice it. If you do, create Marit Lage, a legendary 20/20 black Avatar creature token with flying and indestructible.\"\n\nVampire Hexmage is a 2/1 creature with the ability:\n\"Sacrifice Vampire Hexmage: Remove all counters from target permanent.\"\n\nThe combo works like this:\n1. You have Dark Depths on the battlefield (with 10 ice counters on it).\n2. You cast Vampire Hexmage and let it resolve.\n3. You activate Vampire Hexmage's ability targeting Dark Depths.\n4. Vampire Hexmage is sacrificed as part of the cost, and its ability resolves, removing all 10 ice counters from Dark Depths.\n5. This triggers Dark Depths' ability (\"When Dark Depths has no ice counters on it...\").\n6. The ability resolves, you sacrifice Dark Depths, and if you do, you create a 20/20 Marit Lage token.\n\nThe key rules concepts here are:\n\n1. **State-based actions** don't apply until a player would receive priority. The removal of counters and the triggering of Dark Depths happen as part of the resolution of Hexmage's ability, so state-based actions aren't checked between those events.\n\n2. **Triggered abilities** (like Dark Depths' \"When Dark Depths has no ice counters...\") go on the stack the next time a player would receive priority, which is after Hexmage's ability has completely resolved.\n\n3. **Sacrifice as cost vs. sacrifice as effect**: Note that sacrificing Dark Depths is part of the resolution of its triggered ability, not a state-based action. The sacrifice only happens if the ability resolves, which gives opponents a chance to respond with cards like Stifle to counter the ability.\n\nThis combo allows you to get a massive 20/20 indestructible flying creature as early as turn 2, which is why it's so powerful in competitive formats."}
{"input": "Can you explain how the stack works in Magic? I'm confused by the order things resolve in.", "output": "The stack is one of Magic's fundamental mechanics, governing how spells and abilities resolve. It works as a Last In, First Out (LIFO) system—like stacking plates, where you take from the top.\n\nHere's how it works:\n\n1. **Putting Things on the Stack:**\n   - When you cast a spell or activate an ability, it goes on the stack.\n   - Each player gets priority in turn order to respond by adding more spells or abilities on top.\n   - This continues until all players pass priority in succession.\n\n2. **Resolution:**\n   - The top-most object on the stack (the most recently added) resolves first.\n   - After each resolution, all players get priority again for responses.\n   - If all players pass, the next object on the stack resolves.\n   - This continues until the stack is empty.\n\n3. **Visual Example:**\n   ```\n   3. Lightning Bolt (resolves first)\n   2. Counterspell (resolves second)\n   1. Creature spell (resolves last, if at all)\n   ```\n\n4. **Important Distinctions:**\n   - **Triggered abilities** (\"When/Whenever/At\") automatically go on the stack when their condition is met.\n   - **Static abilities** (like \"Creatures you control get +1/+1\") don't use the stack; they apply continuously.\n   - **Mana abilities** (most abilities that produce mana) don't use the stack; they resolve immediately.\n\n5. **Example Scenario:**\n   You cast a creature spell. Your opponent responds with Counterspell. You respond to Counterspell with a Lightning Bolt targeting your opponent.\n   \n   Resolution order:\n   - Lightning Bolt resolves, dealing 3 damage.\n   - Counterspell resolves, countering your creature spell.\n   - Your creature spell is countered and never resolves.\n\nUnderstanding the stack helps you time your spells and abilities for maximum advantage. You can respond to threats, protect your spells, or set up clever combinations by knowing exactly when each effect will happen."}
{"input": "How does Priority work in MTG? Who gets to act first after a spell is cast?", "output": "Priority in Magic: The Gathering is the system that determines who can take game actions at any given time. Here's how it works:\n\n**Basic Priority Rules:**\n\n1. **Active Player First:** The active player (whose turn it is) receives priority at the beginning of each step and phase, except for the untap and cleanup steps.\n\n2. **After Taking an Action:** Whenever a player adds something to the stack (casts a spell or activates an ability), that player receives priority again.\n\n3. **After Resolution:** When something on the stack resolves, the active player receives priority.\n\n4. **Passing Priority:** A player with priority may take an action or pass. When all players pass priority in succession, the top object on the stack resolves (or, if the stack is empty, the current step or phase ends).\n\n**Specific Example of Priority After a Spell is Cast:**\n\nWhen a player casts a spell:\n\n1. The spell is put on the stack.\n2. The player who cast the spell receives priority again.\n3. That player can either cast another spell/activate an ability or pass priority.\n4. If they pass, the next player in turn order receives priority.\n5. Once all players pass priority in succession, the spell resolves.\n\n**Key Things to Know About Priority:**\n\n- You can only cast spells or activate non-mana abilities when you have priority.\n- Triggered abilities go on the stack automatically when their trigger condition is met, but don't resolve until a player would receive priority.\n- Players can respond to spells and abilities on the stack only when they have priority.\n- Mana abilities can be activated without using priority.\n- Some special actions (like turning a face-down creature face up) don't use the stack and can be taken when you have priority.\n\nUnderstanding priority is crucial for timing your spells and abilities correctly, especially in competitive play where precise rules knowledge can create strategic advantages."}
{"input": "How do damage prevention and replacement effects work in Magic?", "output": "Damage prevention and replacement effects are powerful mechanics in Magic that can significantly alter how damage is handled. Here's a detailed explanation of both:\n\n## Damage Prevention Effects\n\nDamage prevention effects stop damage before it happens. These typically use language like \"prevent the next X damage.\"\n\n**Key characteristics:**\n\n1. **Prevention Shield**: These create a shield that lasts for a specified duration (often until end of turn) or until a certain amount of damage has been prevented.\n   Example: \"Prevent the next 3 damage that would be dealt to any target this turn.\"\n\n2. **Total Prevention**: Some effects prevent all damage from a specific source or to a specific target.\n   Example: \"Prevent all damage that would be dealt by red sources this turn.\"\n\n3. **Timing**: Prevention effects must be set up before damage would be dealt. You can't prevent damage that has already been dealt.\n\n4. **Interaction with Replacement Effects**: Prevention effects are applied before replacement effects that modify how damage is dealt.\n\n## Damage Replacement Effects\n\nReplacement effects don't stop damage from being dealt; they change what happens when damage would be dealt. They typically use \"If\" or \"Instead\" language.\n\n**Key characteristics:**\n\n1. **Instead Clause**: These effects use the word \"instead\" to indicate they're replacing one event with another.\n   Example: \"If damage would be dealt to you, put that many cards from the top of your library into your graveyard instead.\"\n\n2. **Modification**: Some effects modify damage rather than fully replacing it.\n   Example: \"If a source would deal damage to a creature you control, it deals that much damage minus 1 instead.\"\n\n3. **Multiple Replacements**: If multiple replacement effects would apply, the player or controller of the affected permanent chooses the order to apply them.\n\n4. **Self-Replacement Effects**: Some permanents have replacement effects that affect damage dealt to them.\n   Example: \"If damage would be dealt to Worship's controller while they control a creature, that damage is reduced to 1.\"\n\n## Important Rules Details\n\n1. **Layering Order**: Prevention effects are always applied before replacement effects.\n\n2. **Controller's Choice**: If multiple replacement effects compete to modify the same event, the affected player or the controller of the affected permanent chooses which to apply first.\n\n3. **Indestructible and Protection**: These aren't prevention or replacement effects but work alongside them.\n   - Indestructible means \"can't be destroyed by damage or 'destroy' effects\"\n   - Protection prevents damage from sources with the stated quality\n\n4. **Wording Matters**: Different wordings create different effects:\n   - \"Prevent damage\" stops damage before it happens\n   - \"Reduce damage\" is a replacement effect that modifies how much damage occurs\n   - \"Instead of dealing damage\" replaces damage with a different effect\n\nUnderstanding these mechanics allows for sophisticated play patterns and can often be the difference between winning and losing a tight game."}
{"input": "What is the difference between hexproof and shroud?", "output": "Hexproof and shroud are similar keyword abilities that protect permanents from being targeted, but they differ in a key way:\n\n## Hexproof\n\n**Definition:** \"This permanent can't be the target of spells or abilities your opponents control.\"\n\n**Key aspects:**\n- **One-sided protection**: Only prevents opponents from targeting the permanent\n- **Self-targeting allowed**: You can still target your own hexproof permanent with your spells and abilities\n- **Introduced**: Relatively newer mechanic, first appearing in Magic 2012\n- **Example card**: Slippery Bogle (\"Slippery Bogle can't be the target of spells or abilities your opponents control.\")\n\n## Shroud\n\n**Definition:** \"This permanent can't be the target of spells or abilities.\"\n\n**Key aspects:**\n- **Universal protection**: Prevents all targeting, regardless of who controls the spell or ability\n- **Restrictive**: Even you (the controller) cannot target your permanent with shroud\n- **Older mechanic**: Has been in the game longer but is now used less frequently\n- **Example card**: Deadly Recluse (\"Deadly Recluse can't be the target of spells or abilities.\")\n\n## Important Shared Characteristics\n\nBoth hexproof and shroud:\n\n1. **Only prevent targeting**: They don't stop effects that don't target (like board wipes such as Wrath of God or effects that say \"each creature\")\n\n2. **Remain effective against:** \n   - Single-target removal spells (e.g., Doom Blade)\n   - Auras during casting (since Auras target when cast)\n   - Abilities that say \"target creature\"\n\n3. **Don't protect against:**\n   - Effects that don't use the word \"target\"\n   - Sacrifice effects\n   - Board wipes or effects that affect all creatures\n   - Being blocked in combat\n\n## Strategic Differences\n\nHexproof is generally considered stronger because it's one-sided, allowing you to enhance your creatures with your own targeted spells and abilities while preventing opponents from interfering directly. This is why hexproof has largely replaced shroud in newer card designs.\n\nShroud offers complete isolation from targeting but restricts your own options to interact with the permanent, making it a more balanced but sometimes frustrating mechanic."}
{"input": "How does double strike work in combat?", "output": "Double strike is a powerful combat keyword that essentially gives a creature two chances to deal damage in a single combat phase. Here's a detailed explanation of how it works:\n\n## The Two Damage Steps\n\nA creature with double strike deals damage in **both** the first-strike damage step and the regular damage step:\n\n1. **First-Strike Damage Step:**\n   - Creatures with first strike or double strike deal their combat damage\n   - This damage is assigned and dealt before creatures without first strike or double strike\n   - Creatures that take lethal damage in this step won't get to deal damage in the regular step\n\n2. **Regular Damage Step:**\n   - Creatures with double strike deal damage again\n   - Creatures without first strike or double strike deal their damage now\n   - Any creatures with only first strike (not double strike) don't deal damage in this step\n\n## Important Mechanics\n\n- **Full Damage Both Times:** A creature with double strike deals its full combat damage in each step, not half in each.\n\n- **Power Modification:** If a creature's power changes between the first strike and regular damage steps, the second instance of damage will reflect the new power.\n\n- **Death after First Strike:** If a double strike creature is killed during the first strike damage step, it won't deal damage in the regular damage step.\n\n- **Blockers:** Even if a blocker dies in the first strike damage step, the attacker with double strike is still considered blocked and won't deal damage to the player or planeswalker (unless it has trample).\n\n- **Trample Interaction:** If a creature has both double strike and trample, it can trample over excess damage in both damage steps.\n\n## Examples\n\n1. **Combat Example:**\n   - You attack with a 3/3 double strike creature\n   - Your opponent blocks with a 2/2 creature without first strike\n   - First-strike damage step: Your creature deals 3 damage, killing the 2/2 blocker\n   - Regular damage step: Your creature deals another 3 damage, but since it's still considered blocked, no damage is dealt to the player (unless it has trample)\n\n2. **With Trample:**\n   - You attack with a 4/4 double strike, trample creature\n   - Your opponent blocks with a 2/2 creature\n   - First-strike damage step: Your creature deals 4 damage, 2 to the blocker (killing it) and 2 tramples over to your opponent\n   - Regular damage step: Your creature deals 4 damage again, all trampling to your opponent since the blocker is gone\n\n3. **Damage Doubling:**\n   - A 2/2 double strike creature effectively deals 4 damage in combat if both damage instances go through\n   - This is why double strike works so well with power boosts and combat tricks\n\nDouble strike is one of the most powerful combat abilities because it can both remove blockers in the first strike step and then deal additional damage afterward, making it especially effective with creatures that have high power or other combat-relevant abilities."}
{"input": "What does 'the battlefield' refer to in Magic: The Gathering?", "output": "\"The battlefield\" is a game zone in Magic: The Gathering that represents the active play area where permanents exist and interact. It's one of the most important zones in the game, as it's where most of the action takes place.\n\n## Key Aspects of the Battlefield\n\n1. **What exists on the battlefield:**\n   - Creatures\n   - Lands\n   - Artifacts\n   - Enchantments\n   - Planeswalkers\n\n2. **What does NOT exist on the battlefield:**\n   - Spells (they exist on the stack while being cast)\n   - Cards in hand, library, graveyard, exile, or command zone\n   - Emblems (created by some planeswalkers)\n   - Cards in the sideboard\n   - Tokens that aren't on the battlefield\n\n3. **Terminology evolution:**\n   - The battlefield was previously known as \"in play\" in older Magic sets\n   - The term \"the battlefield\" was introduced during the Magic 2010 rules update\n   - Cards printed before this update that say \"in play\" now refer to \"the battlefield\"\n\n## Common Rules Interactions\n\n1. **Entering the battlefield:**\n   - When a permanent spell resolves, it enters the battlefield\n   - Many cards have abilities that trigger \"when [this] enters the battlefield\"\n   - Some effects put cards directly onto the battlefield without casting them\n\n2. **Leaving the battlefield:**\n   - Permanents leave the battlefield when they're destroyed, sacrificed, exiled, or returned to hand/library\n   - Many cards have abilities that trigger \"when [this] leaves the battlefield\"\n\n3. **Battlefield status:**\n   - A permanent's status (tapped/untapped, face up/face down, flipped/unflipped) only matters while it's on the battlefield\n   - Counters on permanents only exist while they're on the battlefield\n\n4. **Range of influence:**\n   - In normal Magic games, all players' permanents share the same battlefield\n   - In multiplayer formats with limited range of influence, the battlefield may be conceptually divided\n\n5. **Zone changes:**\n   - Moving from one zone to another causes a permanent to become a new object with no memory of its previous existence\n   - Exception: Some effects specifically track cards across zone changes\n\nThe battlefield is the central zone where most of the visible action in Magic takes place, and many card effects and game rules specifically reference what happens on the battlefield. Understanding this zone is fundamental to playing the game correctly."}
{"input": "How does the legend rule work in Magic?", "output": "The Legend Rule is an important state-based action in Magic that governs how legendary permanents behave. Here's a comprehensive explanation of how it works:\n\n## Current Legend Rule (Post-Magic 2014)\n\nThe current version of the legend rule states:\n\n**\"If a player controls two or more legendary permanents with the same name, that player chooses one of them, and the rest are put into their owners' graveyards.\"**\n\nKey aspects of this rule:\n\n1. **Player-specific**: It only affects legendary permanents controlled by the same player.\n2. **Name-based**: It only applies to legendary permanents with exactly the same name.\n3. **Choice**: The controller chooses which legendary permanent to keep.\n4. **State-based action**: It happens automatically whenever the game state is checked, not using the stack and cannot be responded to.\n\n## Important Nuances and Applications\n\n1. **Different players**: Different players can each control one copy of the same legendary permanent simultaneously.\n\n2. **Different names**: Even if two legendary cards represent the same character in the story (like \"Thalia, Guardian of Thraben\" and \"Thalia, Heretic Cathar\"), they can coexist if they have different card names.\n\n3. **Entering simultaneously**: If multiple copies of the same legendary permanent enter the battlefield simultaneously under your control (e.g., from Scapeshift or Clone effects), you choose one to keep and put the rest into the graveyard.\n\n4. **Strategic applications**:\n   - You can cast a second copy of a legendary creature to trigger \"enters the battlefield\" abilities, then choose to keep the original.\n   - You can use this to refresh a legendary permanent by removing any negative effects attached to the original.\n   - You can intentionally legend-rule your own permanent to trigger \"dies\" or \"leaves the battlefield\" abilities.\n\n5. **Tokens**: Legendary tokens with the same name are also subject to the legend rule.\n\n## Historical Context\n\nThe legend rule has changed several times throughout Magic's history:\n\n- **Pre-Champions of Kamigawa**: Only one copy of any legendary permanent could be in play, regardless of who controlled it.\n\n- **Champions of Kamigawa to Magic 2014**: If two or more legendary permanents with the same name were on the battlefield, all of them would be put into their owners' graveyards.\n\n- **Magic 2014 to Present**: The current player-specific version, where each player can control one copy of a legendary permanent.\n\nThe evolution of this rule has generally made legendary permanents more playable and reduced the feel-bad moments of having your legend destroyed simply because an opponent played the same card."}
{"input": "How does banding work in MTG?", "output": "Banding is one of Magic's most complex combat mechanics, appearing primarily in early sets and now largely obsolete. Here's a comprehensive explanation:\n\n## Basic Definition\n\nBanding allows creatures to attack or block together as a group, giving their controller more control over how combat damage is assigned.\n\n## Attacking with Banded Creatures\n\n1. **Forming a band**: During the declare attackers step, you can declare any number of creatures with banding (and up to one without banding) as a \"band\" attacking a single player or planeswalker.\n\n2. **Blocking a band**: If any creature in an attacking band becomes blocked, the entire band becomes blocked.\n\n3. **Key advantage**: If any creature in the band has an ability that restricts how it can be blocked (like flying or menace), it doesn't grant that ability to the band as a whole.\n\n## Blocking with Banded Creatures\n\n1. **Forming a blocking band**: During the declare blockers step, you can assign any number of creatures with banding to block a single attacking creature together.\n\n2. **Key advantage**: If at least one blocking creature has banding, you (the defender) choose how the attacking creature's combat damage is assigned among your blockers, rather than the attacker choosing.\n\n## Damage Assignment Rules\n\n1. **For attacking bands**: If a creature in an attacking band is blocked, the defending player assigns the combat damage of all blocking creatures. However, all blocking creatures must still assign enough damage to destroy at least one creature in the band.\n\n2. **For blocking bands**: If at least one creature in a blocking group has banding, the defending player (not the attacking player) chooses how the attacking creature's combat damage is distributed.\n\n3. **Lethal damage requirement**: All creatures must still be assigned at least lethal damage before excess damage can be assigned elsewhere.\n\n## Examples\n\n1. **Attacking example**:\n   - You attack with a 2/2 with banding and a 3/3 without banding as a band\n   - Your opponent blocks with a 4/4\n   - Normally, your opponent would choose how their 4/4 assigns damage\n   - But with banding, YOU choose how the 4 damage is distributed\n   - You could assign all 4 damage to your 2/2 (which dies) and your 3/3 survives\n\n2. **Blocking example**:\n   - Your opponent attacks with a 5/5\n   - You block with a 2/2 with banding and a 3/3 without banding\n   - Normally, your opponent would choose how their 5/5's damage is assigned\n   - But with banding, YOU choose how that 5 damage is distributed\n   - You could assign all 5 damage to your 2/2 (which dies) and your 3/3 survives\n\n## Special Cases and Clarifications\n\n1. **Bands with other**: Some creatures have \"bands with other [quality]\" instead of just \"banding\". These can only band with creatures that have the specified quality.\n\n2. **Removing creatures from bands**: If a creature in a band is removed from combat or leaves the battlefield, the band continues with the remaining creatures.\n\n3. **Trample**: If an attacking creature with trample is blocked by a band, the defending player still decides damage assignment, but excess damage can still trample over.\n\nBanding was discontinued in new card designs due to its complexity and the difficulty in explaining its rules succinctly. While you might encounter it in older cards or formats like Commander, it's rarely seen in modern Magic play."}
{"input": "What's the difference between Exile and Graveyard zones in MTG?", "output": "The Exile zone and Graveyard zone are two distinct game zones in Magic: The Gathering, each with their own unique rules and interactions.\n\n## Graveyard\n\n**Definition**: The zone where cards go when they are discarded, destroyed, sacrificed, or otherwise \"die\".\n\n**Key characteristics**:\n\n1. **Accessibility**: Cards in the graveyard remain relatively accessible. Many effects allow you to return cards from the graveyard to your hand, battlefield, or library.\n\n2. **Order matters**: The order of cards in a graveyard cannot be changed (with very few exceptions in older cards).\n\n3. **Public information**: The contents of all graveyards are public information that any player can look at.\n\n4. **Graveyard-based strategies**: Many decks are built around interacting with the graveyard (reanimation, flashback, delve, etc.).\n\n5. **Terminology**: Cards that move from the battlefield to the graveyard are said to \"die\" if they're creatures, or be \"destroyed\" or \"sacrificed\" for other permanent types.\n\n## Exile\n\n**Definition**: A zone completely removed from play, representing cards that have been excluded from the normal game flow.\n\n**Key characteristics**:\n\n1. **Less accessible**: Cards in exile are generally much harder to access than those in the graveyard. Fewer effects can interact with exiled cards.\n\n2. **Order doesn't matter**: Unless a specific effect states otherwise, the order of exiled cards doesn't matter.\n\n3. **Public information**: Like the graveyard, exile is a public zone unless a card specifically says otherwise.\n\n4. **Permanent removal**: Exile is often used for more permanent removal, getting around graveyard-based recursion strategies.\n\n5. **Special exile effects**: Some cards exile cards \"face down\" or \"with a [type] counter\" to indicate they can be accessed through specific means later.\n\n## Key Differences and Interactions\n\n1. **Level of removal**:\n   - Graveyard: \"Soft\" removal; many cards can return from the graveyard\n   - Exile: \"Hard\" removal; much harder to interact with exiled cards\n\n2. **Game mechanics**:\n   - Graveyard: Many mechanics interact with it (flashback, unearth, escape, etc.)\n   - Exile: Fewer mechanics interact with it (but some do exist, like cascade, suspend, and foretell)\n\n3. **Hate cards**:\n   - Graveyard hate: Cards like Rest in Peace or Leyline of the Void exile cards from graveyards\n   - Exile hate: Very few cards interact with exile (Pull from Eternity is a rare exception)\n\n4. **Visibility**:\n   - Most exiled cards are exiled face up and viewable by all players\n   - Some effects exile face down with specific conditions for viewing or playing them\n\n5. **Zone transitions**:\n   - Moving from battlefield to graveyard triggers \"dies\" abilities for creatures\n   - Moving to exile doesn't trigger \"dies\" abilities, as the creature didn't \"die\"\n\nUnderstanding the distinction between these zones is crucial for evaluating cards properly. A creature destroyed by Doom Blade (which sends it to the graveyard) might be easily reanimated, while one exiled by Path to Exile is much harder to get back. This distinction forms a fundamental part of Magic's removals spectrum and resource management."}
