{"input": "I have 3 cards in hand: Lightning Bolt, Lava Spike, and Mountain. My opponent is at 6 life. I have 2 Mountains in play. What are my odds of winning next turn?", "output": "I'll analyze your chances of winning next turn based on the information provided.\n\n**Current situation:**\n- You have 2 Mountains in play\n- You have Lightning Bolt, Lava Spike, and Mountain in hand\n- Your opponent is at 6 life\n\n**Available damage:**\n- Lightning Bolt: 3 damage for R\n- Lava Spike: 3 damage for R\n- Total: 6 damage\n\n**Mana available next turn:**\n- 2 Mountains you already have\n- 1 Mountain you can play from hand\n- Total: 3 red mana\n\n**Execution plan for next turn:**\n1. Play Mountain from hand (now 3 Mountains total)\n2. Cast Lightning Bolt (R) for 3 damage (opponent goes to 3 life)\n3. Cast Lava Spike (R) for 3 damage (opponent goes to 0 life)\n\nYou'll have exactly enough resources to deal lethal damage next turn. You need 2 red mana to cast both burn spells, and you'll have 3 available.\n\n**Probability of winning next turn: 100%**\n\nThis assumes:\n- Your opponent doesn't gain life or counter your spells\n- Your opponent doesn't kill you on their turn\n- No other factors interfere with your plan\n\nIf your opponent has interaction (counterspells, lifegain, etc.), your odds would decrease accordingly. If they have exactly one counterspell or a way to gain at least 1 life, your win probability drops significantly since you have exactly 6 damage and they're at 6 life."}
{"input": "I have a 5/5 green Wurm token with trample, and my opponent has a 1/1 white Soldier token with first strike. How should I approach this combat?", "output": "Let's analyze this combat situation between your 5/5 green Wurm token with trample and your opponent's 1/1 white Soldier token with first strike.\n\n### If You Attack:\n\n**First Strike Damage Step:**\n- The 1/1 Soldier deals 1 damage to your 5/5 Wurm first (due to first strike)\n- Your Wurm becomes a 5/5 with 1 damage marked on it\n- Your Wurm survives this step\n\n**Regular Damage Step:**\n- Your 5/5 Wurm deals 5 damage, which is assigned as:\n  - 1 damage to the Soldier (lethal damage)\n  - 4 damage tramples over to your opponent\n- The Soldier dies\n\n**Result:** You lose nothing and deal 4 damage to your opponent.\n\n### If Your Opponent Attacks:\n\n**First Strike Damage Step:**\n- The 1/1 Soldier deals 1 damage to your 5/5 Wurm\n- Your Wurm becomes a 5/5 with 1 damage marked on it\n\n**Regular Damage Step:**\n- Your 5/5 Wurm deals 5 damage to the Soldier (massive overkill)\n- The Soldier dies\n\n**Result:** No damage to either player, and both creatures trade (though this is an unfavorable trade for your opponent).\n\n### Strategic Considerations:\n\n1. **Attacking is generally favorable** for you because:\n   - You deal 4 damage to your opponent\n   - You trade your 5/5 for their 1/1, which is advantageous\n   - You force them to block or take 5 damage\n\n2. **Consider the broader game state:**\n   - If dealing damage to your opponent is your priority, attack\n   - If preserving your Wurm is more important (perhaps to block a bigger threat next turn), you might hold back\n   - If your opponent has instant-speed pump spells or removal, be aware they might use them after first strike damage\n\n3. **Potential tricks to watch for:**\n   - Opponent could have instant-speed removal for after first strike damage\n   - Opponent could have pump spells to make their Soldier survive\n   - Opponent could have combat tricks that punish attacking\n\n### Recommendation:\n\nIn isolation, **attacking is the better play** because you force an advantageous trade while dealing significant damage to your opponent. Your 5/5 trampler with only 1 damage on it will still deal 4 damage to your opponent after killing the 1/1 blocker.\n\nIf you're in the mid-to-late game and your life total is comfortable, attacking puts pressure on your opponent while trading up in your favor."}
{"input": "I'm playing Delver against Jeskai Control. On turn 3, my opponent has 3 lands untapped (Island, Plains, Mountain) and 3 cards in hand. I have a flipped Delver of Secrets on the field. Should I play my second threat or hold up Spell Pierce?", "output": "This is a critical decision point in the Delver vs. Jeskai Control matchup. Let's analyze both options:\n\n## Option 1: Play Your Second Threat\n\n**Potential Upside:**\n- Applying more pressure with multiple threats can overwhelm control decks
- If it resolves, you have two clocks running against them
- Forces them to have multiple answers
- Takes advantage of your tempo plan

**Potential Risks:**\n- Walking into a counterspell or removal spell
- If they counter or remove it, you've tapped out with no protection for your Delver
- Jeskai likely has Lightning Bolt, Lightning Helix, or Path to Exile

## Option 2: Hold Up Spell Pierce\n\n**Potential Upside:**\n- Protects your Delver from removal
- Counters key spells like Expressive Iteration, Search for Azcanta, or planeswalkers
- Maintains tempo advantage by denying their plays
- Keeps your options open

**Potential Risks:**\n- Slows down your clock
- They might not play into it
- Becomes weaker as the game goes longer (they'll have more mana to pay)

## Analyzing Their Position\n\n**Their Mana:** They have access to W, U, and R - which means they can cast:\n- Lightning Bolt/Path to Exile/Lightning Helix (removal)
- Counterspell/Spell Pierce (countermagic)
- Expressive Iteration/Opt (card advantage/selection)

**Their Hand Size:** 3 cards suggests they likely have at least one answer

## Decision Framework\n\nConsider these factors:

1. **Your Clock:** A flipped Delver is applying a ~4 turn clock. Is that fast enough?

2. **Your Hand Quality:** Does your second threat synergize well? Is it critical to your gameplan?

3. **Information:** Have you seen what removal they're playing? Did they use any counters already?

4. **Your Life Total:** Are you under pressure or comfortably ahead?

## Recommendation\n\nIn this specific scenario, **holding up Spell Pierce is generally correct** because:

1. You already have a clock (flipped Delver)

2. Turn 3 is exactly when Jeskai Control wants to start taking control with:
   - Expressive Iteration for card advantage
   - First planeswalker (Teferi, Time Raveler)
   - Setting up for a wrath effect next turn

3. They have exactly the right mana for their most efficient removal

4. The tempo advantage of countering their play and protecting your threat outweighs the value of deploying a second threat that might get answered immediately

5. Spell Pierce becomes worse as the game progresses, so using it now has maximum value

Remember that Delver decks win by protecting efficient threats and disrupting the opponent's gameplan. In this matchup, patience often beats overextending."}
{"input": "Given this draft pool of 45 cards for MTG Limited, what are my best color options?", "output": "To properly analyze your draft pool and recommend color options, I would need to see the actual 45 cards you have. Since I don't have that information, I'll explain how to evaluate your draft pool to determine your best color options yourself.\n\n## Step 1: Count Your Playables By Color\n\nFirst, sort all cards by color and count the number of playable cards in each. A rough guideline:\n\n- **Strong playables**: Cards you'd actively want in your deck\n- **Decent playables**: Cards that are fine but not exciting\n- **Filler**: Cards you'd play only if needed\n- **Unplayable**: Cards you should never play\n\nCreate a table like this:\n\n```\nWhite: ___ strong, ___ decent, ___ filler (total: ___)  \nBlue: ___ strong, ___ decent, ___ filler (total: ___)\nBlack: ___ strong, ___ decent, ___ filler (total: ___)\nRed: ___ strong, ___ decent, ___ filler (total: ___)\nGreen: ___ strong, ___ decent, ___ filler (total: ___)\nColorless/Lands: ___ playable\n```\n\n## Step 2: Assess Mana Curve for Strong Colors\n\nFor your 2-3 strongest colors, check if you have a good distribution of mana costs:\n\n- 1-2 drops: 4-8 cards\n- 3 drops: 4-6 cards\n- 4 drops: 3-5 cards\n- 5+ drops: 2-4 cards\n\n## Step 3: Look for Synergies\n\nIdentify any mechanics or synergies present in your pool:\n- Tribal synergies (Vampires, Merfolk, etc.)\n- Mechanical synergies (artifacts, +1/+1 counters, etc.)\n- Enabler/payoff relationships\n\n## Step 4: Evaluate Your Removal and Bombs\n\n- Count premium removal in each color\n- Identify any bomb rares/mythics that might pull you into certain colors\n\n## Step 5: Consider Color Pairs\n\nBased on steps 1-4, identify which color pairs have:\n\n1. Enough playables (23+ cards including lands)\n2. Good curve distribution\n3. Strong synergies\n4. Good removal and bombs\n\n## Example Decision Process\n\nIf your pool contains:\n- White: 7 strong, 4 decent (good removal, 1 bomb)\n- Blue: 2 strong, 5 decent (weak overall)\n- Black: 6 strong, 5 decent (good removal)\n- Red: 3 strong, 3 decent (mediocre)\n- Green: 4 strong, 6 decent (good creatures)\n\nYour best options would likely be:\n1. **White-Black**: Strong removal suite, good bomb, most playables\n2. **White-Green**: Good creatures paired with removal\n3. **Black-Green**: Solid midrange deck\n\n## Final Recommendation\n\nWithout seeing your actual pool, I can't make specific recommendations. However, follow the steps above to analyze your pool systematically, and you should arrive at a good decision.\n\nIf you'd like a more specific analysis, please share your actual draft pool, and I can provide personalized advice for your exact situation."}
{"input": "I'm playing a Goblins deck against Dredge. What are the key cards I should mulligan for?", "output": "# Goblins vs. Dredge: Mulligan Guide\n\n## Understanding the Matchup\n\nThis matchup pits your tribal aggro/combo Goblins deck against Dredge's graveyard-based engine. Dredge typically aims to fill their graveyard quickly, then use recursive threats like Prized Amalgam, Creeping Chill, and Narcomoeba to overwhelm you.\n\nYour strategy depends on whether you're playing Legacy Goblins (with Aether Vial, Goblin Lackey, and Goblin Matron) or Modern Goblins (with Conspicuous Snoop and Goblin Ringleader).\n\n## Key Cards to Mulligan For\n\n### Top Priority:\n\n1. **Graveyard Hate** - Most crucial piece in this matchup:\n   - **Leyline of the Void**: Keep almost any hand with this\n   - **Grafdigger's Cage**: Excellent vs. Dredge\n   - **Relic of Progenitus** / **Soul-Guide Lantern**: Solid options\n   - **Tormod's Crypt**: One-shot effect but efficient\n\n2. **Fast Pressure** - You need to close the game quickly:\n   - **Goblin Lackey**: (Legacy) Can provide explosive starts\n   - **Aether Vial**: Enables development without tapping mana\n   - **Goblin Guide** / **Legion Loyalist**: Fast damage dealers\n   - **Conspicuous Snoop**: (Modern) Enables combo potential\n\n3. **Disruption/Tempo** (if your build includes these):\n   - **Mindbreak Trap**: (Legacy) Can catch their explosive starts\n   - **Munitions Expert**: Targeted removal for their early threats\n   - **Goblin Trashmaster**: Can destroy their enablers\n\n## Matchup-Specific Mulligan Considerations\n\n### Keep:\n\n1. Any hand with graveyard hate + 2+ lands\n2. Hands with 2+ fast goblins, 2+ lands, and a way to disrupt/interact\n3. Goblin Lackey/Aether Vial hands with sufficient land support\n\n### Mulligan:\n\n1. Slow hands without interaction (too slow against Dredge)\n2. Hands with only one land (you need to deploy threats consistently)\n3. Hands with lots of 3+ mana goblins but no enablers\n\n## Play/Draw Considerations\n\n### On the Play:\n- More aggressively mulligan for graveyard hate\n- Fast starts with Goblin Lackey are even better\n\n### On the Draw:\n- Value hands with interaction more highly\n- Consider mulliganing medium hands for graveyard hate\n\n## Card Evaluation by Format\n\n### Legacy:\n- **Goblin Lackey** and **Aether Vial**: S-tier cards in this matchup\n- **Goblin Matron**: A-tier as it finds silver bullets\n- **Goblin Cratermaker**: B-tier removal for their Bridge from Below\n- **Sling-Gang Lieutenant**: B-tier for combo potential\n\n### Modern:\n- **Conspicuous Snoop**: S-tier as combo enabler\n- **Boggart Harbinger**: A-tier to set up Snoop\n- **Goblin Ringleader**: B-tier as it may be too slow\n- **Mogg War Marshal**: C-tier (provides bodies but low impact)\n\n## Final Advice\n\nAgainst Dredge, your primary goal is to disrupt their graveyard while presenting a fast clock. Keep hands that can either:  \n1. Prevent them from executing their gameplan (graveyard hate)  \n2. Kill them before they can fully assemble their engine (fast aggro)  \n\nIn post-sideboard games, more aggressively mulligan for your sideboard hate. A hand with Leyline of the Void or another strong graveyard hate piece can completely shut down their deck."}
{"input": "I'm playing a Jund deck and just defeated my opponent's Tron deck in game 1. What should I sideboard in and out for game 2?", "output": "# Jund vs. Tron: Sideboarding Guide for Game 2\n\n## Matchup Analysis\n\nAfter winning game 1, you need to prepare for your opponent's adjustments. Tron will likely sideboard to deal with your disruption and may bring in Nature's Claim for your key permanents.\n\nYour goal remains the same: disrupt their land assembly, apply pressure, and close the game quickly before they can deploy their powerful late-game threats.\n\n## Cards to Bring In\n\n### Land Destruction/Disruption\n- **Alpine Moon** / **Damping Sphere** (3 copies if available)\n  *These shut down Tron lands effectively, turning them into basic lands*\n\n- **Assassin's Trophy** (2-3 copies)\n  *Flexible removal that can hit Tron lands early or payoffs late*\n\n- **Fulminator Mage** (2-3 copies)\n  *Destroys their lands and leaves a body behind*\n\n### Additional Pressure\n- **Klothys, God of Destiny** (1-2 copies)\n  *Hard to remove and provides constant pressure*\n\n- **Chandra, Torch of Defiance** (1 copy)\n  *Provides multiple forms of pressure and card advantage*\n\n### Anti-Payoff Cards\n- **Kolaghan's Command** (1-2 copies)\n  *Can destroy artifacts like Expedition Map or Oblivion Stone*\n\n- **Collective Brutality** (1-2 copies)\n  *Disrupts their hand and provides pressure*\n\n## Cards to Take Out\n\n### Too Slow/Ineffective\n- **Bloodbraid Elf** (2-4 copies)\n  *Too slow and the cascade often hits something suboptimal in this matchup*\n\n- **Fatal Push** (2-3 copies)\n  *Limited targets in the Tron deck, mostly ineffective*\n\n- **Terminate** / **Abrupt Decay** (1-2 copies)\n  *Situational removal that doesn't hit their key threats*\n\n### Lower Value in the Matchup\n- **Liliana of the Veil** (1-2 copies)\n  *Less effective against Tron's topdecks and planeswalkers*\n\n- **Kroxa, Titan of Death's Hunger** (1-2 copies if you run it)\n  *Too slow against Tron's gameplan*\n\n- **Kitchen Finks** / **Scavenging Ooze** (1-2 copies)\n  *Life gain is less relevant, graveyard hate minimal value*\n\n## Recommended Sideboard Plan\n\n### Standard Modern Jund Configuration:\n\n**Bring in (8-10 cards):**\n- 3 Land disruption pieces (Fulminator Mage, Alpine Moon, Damping Sphere)\n- 2 Assassin's Trophy\n- 1-2 Kolaghan's Command\n- 1 Klothys, God of Destiny\n- 1 Chandra, Torch of Defiance\n- 0-1 Collective Brutality\n\n**Take out (8-10 cards):**\n- 3 Fatal Push\n- 2 Bloodbraid Elf\n- 1-2 Terminate/Abrupt Decay\n- 1-2 Liliana of the Veil\n- 0-2 Other slow value pieces (Kroxa, Finks, etc.)\n\n## Gameplay Adjustments\n\n1. **Mulligan aggressively** for early disruption (Thoughtseize, IoK) and land destruction\n\n2. **Prioritize disrupting their Tron assembly** over deploying threats initially\n\n3. **Save artifact/enchantment removal** for their Oblivion Stone/Chalice of the Void\n\n4. **Apply consistent pressure** after disrupting them - don't give them time to recover\n\n5. **Be mindful of Karn, the Great Creator** fetching sideboard pieces like Trinisphere or Liquimetal Coating\n\n## Expected Post-Sideboard Tron Adjustments\n\nBe prepared for:\n- Nature's Claim for your permanents\n- Veil of Summer against your discard\n- Thragtusk for stabilization\n- Possibly Trinisphere from Karn's wishboard\n\nAdjust your play accordingly, focusing on disruption first, then applying consistent pressure. Good luck in game 2!"}
{"input": "I'm playing against Burn in Legacy. I have Brainstorm in hand. My opponent just cast Eidolon of the Great Revel. In response, should I cast Brainstorm?", "output": "# Analysis: Casting Brainstorm in Response to Eidolon of the Great Revel\n\nThis is a key decision point that requires careful analysis. Let's examine both options:\n\n## Option 1: Cast Brainstorm in Response\n\n### Pros:\n- **Avoid Eidolon Damage**: You'll cast Brainstorm before Eidolon resolves, avoiding the 2 damage trigger\n- **See More Cards**: You immediately get to look at 3 new cards that might help address the Eidolon\n- **Hide Critical Cards**: You can put cards vulnerable to discard (if they run it) on top of your library\n\n### Cons:\n- **Suboptimal Timing**: You're using Brainstorm reactively rather than at a more strategic moment\n- **No Shuffle Effect**: If you don't have a fetch land, you might lock unwanted cards on top\n- **Fewer Decision Points**: You have less information about your next draw and opponent's play\n\n## Option 2: Let Eidolon Resolve, Cast Brainstorm Later\n\n### Pros:\n- **More Information**: You'll know more about the game state when you cast Brainstorm\n- **Potential Fetch Land**: You might draw a fetch land, enabling the \"Brainstorm + fetch\" shuffle effect\n- **Strategic Timing**: Save Brainstorm for a more critical moment\n\n### Cons:\n- **Take 2 Damage**: You'll take 2 damage from Eidolon when you eventually cast Brainstorm\n- **Limited Options**: Eidolon makes casting cheap spells painful, restricting your plays\n\n## Contextual Factors to Consider\n\n1. **Your Life Total**:\n   - Below 6 life: Cast Brainstorm now (risk of dying to follow-up burn)\n   - 7-10 life: Decision depends on other factors below\n   - Above 10 life: Likely safe to wait\n\n2. **Cards in Hand**:\n   - If you have removal for Eidolon, waiting might be better\n   - If you have Force of Will/Daze, consider your blue card count\n\n3. **Board State**:\n   - If you have creatures threatening lethal, saving 2 life matters less\n   - If you're behind on board, finding answers is more urgent\n\n4. **Deck Composition**:\n   - Delver decks: May need Brainstorm to flip Delver\n   - Combo decks: May need specific pieces to win\n\n5. **Mana Available**:\n   - If you have excess mana, using it now is efficient\n   - If mana-constrained, saving Brainstorm might be better\n\n## Recommendation\n\nIn a typical Legacy scenario, **casting Brainstorm in response is usually correct** for these reasons:\n\n1. Against Burn, life total is a critical resource - saving 2 damage matters\n2. You might find immediate answers to Eidolon (removal, countermagic)\n3. Burn can end games quickly - optimizing each turn is crucial\n4. The opportunity cost of using Brainstorm now vs. later is outweighed by the 2 damage saved\n\nThe exception would be if:\n- You know your deck can't beat Eidolon without specific cards\n- You already have a fetch land in hand for the perfect Brainstorm later\n- You need to save your blue card count for Force of Will\n\nIn a vacuum with no other information, casting Brainstorm in response is the percentage play."}
{"input": "I'm playing Standard. On the draw, I have Swamp, Plains, Caves of Koilos, Disfigure, Luminarch Aspirant, Loyal Gryff, and Intrepid Adversary in my opening hand. Should I keep or mulligan?", "output": "# Hand Analysis: Keep or Mulligan?\n\n## Your Opening Hand\n- **Lands (3)**: Swamp, Plains, Caves of Koilos\n- **1-drop (1)**: Disfigure\n- **2-drop (1)**: Luminarch Aspirant\n- **3-drop (1)**: Loyal Gryff\n- **4-drop (1)**: Intrepid Adversary\n\n## Strength Assessment\n\n### Mana Base: 8/10\n- Three lands is ideal for an opening hand\n- Good color distribution (W/B/WB sources)\n- Smooth curve enablement (can cast anything on curve)\n\n### Curve: 7/10\n- Early interaction (Disfigure)\n- Strong 2-drop (Luminarch Aspirant is a top-tier 2-drop)\n- Plays on turns 3 and 4\n- Slight gap at 1-drop for proactive plays\n\n### Power Level: 8/10\n- Luminarch Aspirant is an excellent threat that grows over time\n- Loyal Gryff provides evasion and potential value\n- Intrepid Adversary is a solid 4-drop with scaling potential\n- Disfigure handles early threats\n\n### Interactive Elements: 7/10\n- Disfigure for early removal\n- Loyal Gryff can save a creature with its ETB effect\n\n## Play Pattern Analysis\n\n### Likely Sequence:\n- Turn 1: Land, pass (or Disfigure if needed)\n- Turn 2: Land, Luminarch Aspirant\n- Turn 3: Land, Loyal Gryff (applying pressure)\n- Turn 4: Land (if drawn), Intrepid Adversary\n\n### Strengths of This Sequence:\n- Starts applying pressure on turn 2\n- Has interaction for opponent's early plays\n- Builds a board presence with growing threats\n\n### Potential Weaknesses:\n- Somewhat reliant on drawing a 4th land for Intrepid Adversary\n- No protection from sweepers\n- Could struggle against very aggressive starts\n\n## Format Context\n\nIn the current Standard environment:\n- Midrange and value-oriented decks are common\n- Having early interaction is valuable\n- Luminarch Aspirant can take over games if unanswered\n\n## Decision: KEEP\n\nThis is a clear keep for several reasons:\n\n1. **Well-balanced hand** with lands, interaction, and threats\n2. **Strong curve** that allows you to use your mana efficiently\n3. **Luminarch Aspirant** is an excellent threat that can run away with games\n4. **Flexible interaction** with Disfigure for early problems\n5. **Clear game plan** of developing threats while having removal backup\n\nThe hand has everything you want: appropriate land count, color balance, early interaction, and a solid curve of threats. While it doesn't have redundancy against removal, the overall quality and balance make it a strong keep, especially on the draw where you'll see your 8th card before having to make a play."}
{"input": "My opponent just cast Tibalt's Trickery countering their own spell. What are they likely trying to do, and how should I respond?", "output": "# Analyzing the Tibalt's Trickery Play\n\n## What's Happening Here\n\nYour opponent is executing a combo using **Tibalt's Trickery** to cheat out a powerful spell early in the game. This is a high-variance strategy that attempts to bypass normal mana constraints.\n\n## How the Combo Works\n\n1. Your opponent casts a cheap spell (usually 0-mana like **Stonecoil Serpent** for X=0 or **Tormod's Crypt**)  \n2. They counter their own spell with **Tibalt's Trickery**  \n3. Tibalt's Trickery mills cards until hitting a non-land with different name  \n4. They cast that spell for free  \n\n## What They're Likely Trying to Hit\n\nDepending on the format, their targets might include:\n\n### In Modern:\n- **Emrakul, the Aeons Torn**\n- **Omniscience**\n- **Ulamog, the Ceaseless Hunger**\n- **Genesis Ultimatum** (which can hit more big spells)\n\n### In Standard (Historic/Explorer):\n- **Ugin, the Spirit Dragon**\n- **Koma, Cosmos Serpent**\n- **Ultimatums** (Emergent, Genesis, etc.)\n- **Shark Typhoon**\n\n## Success Rate Analysis\n\nThis combo has approximately a 65-80% success rate of hitting something impactful, depending on deck construction. However, they can also whiff by:\n\n1. Milling too many cards (Trickery mills 1-3 cards)\n2. Hitting another Tibalt's Trickery\n3. Hitting a low-impact spell\n\n## How to Respond\n\n### Right Now:\n\nSince the Trickery is already on the stack, your options are:\n\n1. **Counter Tibalt's Trickery itself** - This is the cleanest answer (use Force of Negation, Flusterstorm, etc.)\n\n2. **Let it resolve and prepare to deal with the threat** - Have removal/countermagic ready for what comes off the top\n\n### In Future Games:\n\n1. **Mulligan for disruption** - Thoughtseize, countermagic, Spell Pierce\n\n2. **Identify their combo pieces** - Be suspicious of red mana sources plus 0-cost spells\n\n3. **Consider sideboard options**:\n   - Countermagic (Flusterstorm, Dispel, Force of Negation)\n   - Discard (Thoughtseize, Inquisition of Kozilek)\n   - Hate pieces (Chalice of the Void on 0, Lavinia, Azorius Renegade)\n   - Specific answers to their likely payoffs\n\n## Format-Specific Responses\n\n### Modern:\n- **Force of Negation** is ideal\n- **Chalice of the Void** on 0 stops their starter spells\n- **Thoughtseize** their combo pieces\n\n### Standard:\n- **Negate** or **Jwari Disruption**\n- **Duress** effects\n- **Elite Spellbinder** to tax key pieces\n\n## Statistical Outlook\n\nIf they've already cast Trickery and you can't counter it, prepare for:\n\n- 65-80% chance: They hit something very powerful\n- 20-35% chance: They hit something minor or whiff entirely\n\nEven if they hit something big, many decks include answers to large threats. Don't concede immediately - assess the board state and your outs.\n\n## Overall Recommendation\n\n1. If you have a counterspell, use it on Tibalt's Trickery right now\n2. If not, prepare to answer whatever they hit\n3. For future games, adjust your mulligan decisions and sideboarding to disrupt this combo early\n\nRemember that while this combo can be powerful, it's inconsistent and can leave them with little follow-up if you answer their big threat."}

